#ifndef DBDEFS
#define DBDEFS

#include <pthread.h>	// for pthread specific stuff below
#include <time.h>       // for struct tm
#include <sys/times.h>  // for times()

//*************************************************************
// comment out to use our own local versions of these variables
//#define USE_LIB_CL4
//
//*************************************************************
// various debugs , uncomment to send debug output to stdout
// #define DEBUG_CL4
// #define DEBUG_DUMP
//*************************************************************
// Quick MACROs to swap bytes around

#define SWAP_SHORT(x)(*((unsigned char*)(x)+1) | (unsigned short)(*x << 8))
#define MSHORT(x) ((unsigned short)(x << 8) | (unsigned short)((x >> 8)& 0xFF))
#define M_INT(x) ((unsigned int)(x << 24) | (unsigned int)((x >> 8) & 0x0000FF00 )| (unsigned int)((x << 8)& 0x00FF0000)| (unsigned int)((x >> 24)& 0xFF))

// macros for accessing CL4 tables easily
//#define PTARR(x) (x ? &ptarr.TableAddr[x - 1] : 0)	// PTAB - Program instructions - is a *function* in REAL clcomp
#define ENARR(x) (x ? &enarr.TableAddr[x - 1] : 0)	// ENATB - Expressions 
#define XTARR(x) (x ? &xtarr.TableAddr[x - 1] : 0)	// XTAB  - Screen display / accept fields
#define PRARR(x) (x ? &prarr.TableAddr[x - 1] : 0)	// PRTAB - Print variables/fields
#define KXARR(x) (x ? &kxarr.TableAddr[x - 1] : 0)	// KXTAB - Create temp tables
#define XFARR(x) (x ? &xfarr.TableAddr[x - 1] : 0)	// XFTAB - Copy (xfer) from table to table
#define RDARR(x) (x ? &rdarr.TableAddr[x - 1] : 0)	// RDTAB re-display
#define RTARR(x) (x ? &rtarr.TableAddr[x - 1] : 0)	// relation specifier (join etc.)
#define RAARR(x) (x ? &raarr.TableAddr[x - 1] : 0)	// range specifier
#define SFARR(x) (x ? &sfarr.TableAddr[x - 1] : 0)	// file specifier

#define STRARR(x) (x ? &strarr.StringTable[x - 1] : 0)	// file specifier

#define max_it &itab[no_itabs]

typedef struct 
{
	short	KXFlags;
	short	WhereEXP;
	short	NumTTs;
	short	field_6;
	short*	KeyElemIDs;
	short	NumKeyFields;
	short	field_E;
	short*	TkeyTy;
	short*	DataElemIDs;
	short	NumDataFields;
	short	KeySize;
	short	RecSize;
	short	field_1E;
	int		TTno;
	int*	TTlist;
	char	TableName[24];
}KXTAB;			// create temp table records

typedef struct 
{
	char	*AttrName;
	short	*AttrData;
}TCSCRATTR;

typedef struct 
{
	char	*AttrName;
	char	**AttrStrData;
}TCSTRATTR;

typedef struct 
{
	char	*AttrName;
	int		*AttrBool;

}TCBOOLATTR;

typedef struct 
{
	short	RangeType;
	short	RangeFrom;
	short	RangeTo;
	short	StringOffset;
	short	field_8;
	short	field_A;
}RATAB;		// Range type records

typedef struct 
{
	short	cmd_flags;		// command flag bits
	short	PRTno;			// PRTAB no. describing variable to be read/written
	short	AliasEnt;		// Expression number describing Aliasname
	short	FileNameEnt;	// Expression number describing filename
}SFTAB;

typedef struct 
{
	short	FCBFlags;
	short	field_2;
	int		child_PID;		// child PID for pipes
	int		field_8;
	int		field_C;
	FILE*	RD_FILE;
	FILE*	WR_FILE;
	char*	ALIAS;
}FCB;

typedef struct 
{
	char*	KeyName;
	int		KeyNo;
}KEYTAB;

typedef struct	
{
	int		TTno_to;
	int		TTno_from;
}XFTAB;

typedef struct				// Label Definitions
{
	short	NameLen;		// Length of LabelName that follows structure
	short	PTno;			// PTAB#
	char	LabelName[2];	// Variable size structure
}LTAB;	// sizeof() == 6

typedef struct 
{
	short	VAR_ENTno;		// 0 expression describing variable we are outputting
	short	WIDTH_ENTno;	// 2 expression describing wdith required, or number of times to repeat
	short	WIDTH_FLAGS;	// 4 width/number of times to repeat. May also have upper bit flags set 
	short	ReservedFlags;	// 6 Non-zero means print reserved value
	short	NextPR;			// 8 next 
}PRTAB;

typedef struct 
{
	short	PTfalse;		// Jump to this instruction when "IF" expression  evaluates to false
	short	PTABno;
	int		HasElse;		// true if IF/ENDIF block has an 'ELSE' case!
	int		HasElsif;
	short	itType;			// 1 = 'if', 2 = 'while' ?
	short	field_E;
}ITAB;

typedef struct 
{
	short	LockType;
	short	OpType;
	short	WhereEXP;
	short	field_6;
//	int		TTno;
//	short	field_C;
//	short	field_E;
//	short	NextRT;
//	short	field_12;
	int		TTno;
	short	enleft;			// Pointer to expression.
	short	enright;		// Pointer to expression. Used by JOIN and REPLACE
	short	NextRT;			// chain to next RTAB (if required)
	short	field_12;		// padding
}RTAB;

//=============================================

// ENTAB defs

typedef struct
{
	short Enoper;
	short RecNo;
} ENOP;

typedef struct
{
	short TTno;
	short VarNum;
} ENREF;

typedef union
{

	ENOP	Enop;
	ENREF	Enref;
	float	float4;
	long	long8;
	char	char16[4];   

} ENUN;

typedef struct 
{
	short	entype;
	short	extOpCode;		// unused in real CL4 - could be used for extended opcodes??
	//short	TTno;			// enum which can hold few diff types
	//short	RecNo;
	ENUN	Enun;
	short	enleft;			// LVALUE	Dest	tree structue pointing at other expressions
	short	enright;		// RVALUE	Src
}ENTAB;

//=============================================

typedef struct 
{
	short	RDTFlags;
	short	ENTno;			// expression describing single field
	int		TTno;
	short	NextRD;
	short	field_A;
}RDTAB;

typedef struct VARTREE VARTREE;
struct VARTREE
{
	short	VarNo;
	short	field_2;
	char	*VarName;
	VARTREE	*VarPrev;
	VARTREE	*VarNext;
};

typedef struct SCR SCR;	// same as type24
struct SCR
{
	short	PT_start;	// LineNo
	short	PT_end;		// LineNo2
	SCR		*NextSCR;
};

typedef struct ONESC ONESC;

struct ONESC
{
	 short	OESCFlags;
	 short	BlockNo;
	 short	KeyNumber;
	 short	field_6;
	 char	*BlockName;
	 ONESC	*NextESC;
};

typedef struct 
{
	short	Flags      ;		// 0
	short	Attr       ;		// 2
	short	ScrAttrib  ;		// 4
	short	FLDnum     ;		// 6	Number displayed on screen when Field Numbering is *on*	short	field_6    ;
	short	Width      ;		// 8
	short	width      ;		// 10
	short	PCol	    ;		// 12
	short	PLine		;		// 14
	short	ACol		;		// 16
	short	ALine	   ;		// 18
	short	C_X		   ;		// 20
	short	C_Y		   ;		// 22
	ONESC	*onesc      ;		// 24
	short	RangeID    ;		// 28
	short	field_1E   ;		// 30
	int		field_20   ;		// 32
	short	VarExpNo   ;		// 36
	short	widthEXP   ;		// 38
	short	PCol_exp   ;		// 40
	short	PLine_exp  ;		// 42
	short	ACol_exp   ;		// 44
	short	ALine_exp  ;		// 46
	short	Prompt_exp ;		// 48
	short	field_32   ;		// 50
}XTAB;		// sizeof = 52

typedef struct EXPR EXPR;		// forward ref

typedef struct //(sizeof=0x48)
{
		int		BTFlags;		//0		not set in clcomp
		short	EndLine;		//4
		short	fmts;			//6
		short	StartLine;		//8
		short	TTno;			//0A
		short	Scrs;			//0C
		short	field_E;		//0E	padding
		EXPR	*EXPR;			//10
		ONESC	*On_delete;		//14
		ONESC	*On_exit;		//18
		ONESC	*On_excep;		//1C
		ONESC	*On_entry;		//20
		SCR		*Screens;		//24	screen ptr
		char	SrchMode;		//28
		char	Curr_Mode;		//29
		char	Maintain[7];	//2A
		char	BlockName[21];	//31
		short	field_46;		//46	padding
}BTAB;

typedef struct		//(sizeof=0x8)
{
		short	SrcLineNo;
		short	OpCode;
		short	Operand;	// multi-purpose field. Mainly used by "set" commands
		short	TABno;		// reference to another table. depends on OpCode type.
}PTAB;

typedef struct INCLUDE INCLUDE;

struct INCLUDE
{
		short	LastLine;
		short	field_2;
		FILE	*filePTR;
		char	*FileName;
		INCLUDE	*parentINC;
		INCLUDE	*childINC;
};

typedef struct 
{
	int		StrMaxSize;
	int		StrTableSize;
	char	*StringTable;
} CLStrArray;


typedef struct 
	{
	short	Qdeflen;	//0		Default 
	short	QLunk1;		//2		??
	char*	QfieldHd;	//4		String Field Heading
	char*	Qdata;		//8		Variable Size work area. Vartype dependent
	char	Qrequired;	//12	Is Value required?
	char	Qunused[3];	//13
	} Qlen;

typedef struct 
	{
	short	TDFtype;	//0
	short	FLDstat;	//2		// &0x8000 = Key Field , bit 0 set = data available
	short	FLDelemID;	//4		// Field ID in Elements table
	short	FLDlen;		//6		// Field length in DBase
	Qlen	*FLDqlen;	//8		// Ptr to 16byte work area
	char	*FLDname;	//12	// Ptr to Field Name
	char	*FLDdata;	//16	// Data area, gets filled when recs read
	char	FLDtype;	//20	// Field Type
	char	field_15;	//21	// not set, but clcomp examines!!!
	char	FLDunk7;	//22
	char	FLDunk8;	//23	// 3 bytes unused? sizeof() = 24   x18
	} FLDdesc;

// Bitmasks for FLDstat field:
#define		FLDdatav	0x0001;
#define		FLDkey		0x8000;

typedef struct 
	{
	int		DBno;			//x00	0		// 
	char	*FullDBname;	//x04	4		// DBase name 
	int		DBcontext;		//x08	8		// Context returned by CLinit()
	} DBase ;			// This struct lives at *(dtab + (12 * DBno))

typedef struct 
	{
	int		DBcontext;		//x00	0		Context identifies user. Returned by CLinit()
	short	TDlocked;		//x04	4		Bit 6 indicates locked (0x0040), 5(0x20) = Data Available (bit 0 = unlocked? see _ulckrec()
	short	NumFields;		//x06	6		Number of fields in a record
	short	TTrtd;			//x08	8		Relative TD number. (returned by rtdget(TTptr))		
	short	TDrecsize;		//x0A	10		Size of Record in bytes
	int		DBnumber;		//x0C	12		Associated DBnumber
	EXPR*	TTselect;		//x10	16		ptr to Select Expression
	FLDdesc	*TTfields;		//x14	20		Pointer to an Array of FieldDescriptors
	char	TableName[21];	//x18	24		Limited Table name
